app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
    render json: @restaurants.paginate(:page => params[:page], :per_page => PER_PAGE)
---
SELECT "restaurants".* FROM "restaurants"
SELECT  "restaurants".* FROM "restaurants" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]

  def menu_items
     @menu_items = @restaurant.menu_items.paginate(:page => params[:page], :per_page => PER_PAGE)
---
SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."restaurant_id" = $1 AND (1 = 0) LIMIT $2 OFFSET $3  [["restaurant_id", 1], ["LIMIT", 2], ["OFFSET", 0]]

    def set_restaurant
      @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]